app/controllers/genres_controller.rb

SELECT * FROM `genres`
---
  def index
    @genres = Genre.all

INSERT INTO `genres` (`name`, `created_at`, `updated_at`) VALUES('SciFi', '2011-05-03 00:20:34', '2011-05-03 00:20:34')
---
  def create
    @genre = Genre.new(params[:genre])

    respond_to do |format|
      if @genre.save