app/controllers/movies_controller.rb

  def index
    @movies = Movie.all(:order => :title);
---
SELECT * FROM `movies`

  def show
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)

  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save
---
INSERT INTO `movies` (`created_at`, `title`, `genre_id`, `updated_at`) VALUES('2011-05-03 00:22:18', 'TestMovie', 1, '2011-05-03 00:22:18')