app/controllers/tags_controller.rb

  def index
    @tags = Tag.all
---
SELECT * FROM `tags`

  def create
    @tag = Tag.new(params[:tag])

    respond_to do |format|
      if @tag.save
---
INSERT INTO `tags` (`name`, `created_at`, `updated_at`) VALUES('Date Movie', '2011-05-03 00:21:21', '2011-05-03 00:21:21')